icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
// (C) 2023 OE1KBC Kurt Baumann, OE1KFR Rainer 
//
// 20230326: Version 4.00: START

#include "configuration.h"
#include "capture_functions.h"

#include <Arduino.h>
#include "instrument.h"
#include "track_warning.h" // TRK-01: Warnhinweis bei aktivem Track
#include <maxhop.h>         // CS-01: plausibility of the persisted text hop limit
#include <SPI.h>

#include <debugconf.h>
#include <time.h>
#include <nrf52_functions.h>
#include <nrf52_radio.h>
#include <settings_sanitize.h> // #1132: resolve_tx_power sentinel normalization
#include <extudp_functions.h>

#include <TinyGPSPlus.h>

// MeshCom nrf52 functions
#include <RAK13800_W5100S.h>
#include <WisBlock-API.h>

#include <nrf_eth.h>

#include "onebutton_functions.h"

#include <SX126x-RAK4630.h>


#if defined(HAS_TFT) || defined(HAS_TFT_114)
#include "tft_display_functions.h"
#endif

bool bDEEP_SLEEP = false;

#ifdef HAS_TFT_114
#include <Adafruit_GFX.h>    // Core graphics library
#include <Adafruit_ST7789.h> // Hardware-specific library for ST7789

/*
Wiring an ST7789 (SPI):
VCC: 3.3V
GND: Ground
SCL/SCK: SPI Clock Pin
SDA/MOSI: SPI MOSI Pin
RES/RST: Digital IO (Reset)
DC: Digital IO (Data/Command)
CS: Digital IO (Optional, if not present, the display is always active) 
*/

SPIClass SPI_TFT(NRF_SPIM3, PIN_SPI1_MISO, PIN_SPI1_SCK, PIN_SPI1_MOSI);
Adafruit_ST7789 tft1 = Adafruit_ST7789(&SPI_TFT, PIN_TFT_CS, PIN_TFT_DC, PIN_TFT_RST);


#endif

#include "Adafruit_LPS2X.h"
#include "Adafruit_SHTC3.h"

#if defined(ENABLE_GPS)
#include "gps_functions.h"
#endif

#include <OneButton.h>
#include <malloc.h>
OneButton btn;

// nRF52 heap monitoring using Adafruit framework APIs (debug.h)
// dbgHeapTotal() = __HeapLimit - __HeapBase (linker symbols)
// dbgHeapUsed()  = mallinfo().uordblks (allocated bytes)
extern int dbgHeapTotal(void);
extern int dbgHeapUsed(void);

static uint32_t nrf52_getFreeHeap(void)
{
    return (uint32_t)(dbgHeapTotal() - dbgHeapUsed());
}

// Largest contiguous free block — binary search probe (fragmentation indicator)
static uint32_t nrf52_getMaxFreeBlock(void)
{
    uint32_t lo = 0, hi = nrf52_getFreeHeap();
    while (lo + 64 < hi) {
        uint32_t mid = (lo + hi) / 2;
        void *p = malloc(mid);
        if (p) { free(p); lo = mid; }
        else   { hi = mid; }
    }
    return lo;
}

// Min-free watermark since boot
static uint32_t nrf52_heapMinFree = UINT32_MAX;
static uint32_t nrf52_heapFree = UINT32_MAX;

// Ethernet Object
NrfETH neth;

// flag to indicate one second 
unsigned long retransmit_timer = 0;

// flag to update NTP Time
unsigned long updateTimeClient = 0;

// resend Ping Timer
unsigned long resendPing = 0;

// timers
uint32_t dhcp_timer = 0;         // dhcp refresh timer

static uint8_t convBuffer[UDP_TX_BUF_SIZE+50]; // we need an extra buffer for udp tx, as we add other stuff (ID, RSSI, SNR, MODE)

// ETH Prototypes
void sendUDP();                                      // UDP tx routine
void sendHeartbeat();


// MeshCom Common (esp32/nrf52) functions
#include <lora_setchip.h>
#include <loop_functions.h>
#include <loop_functions_extern.h>
#include <regex_functions.h>
#include "setlog_lines.h"
#include "dedup_functions.h"
#include <command_functions.h>
#include <aprs_functions.h>
#include <batt_functions.h>
#include <lora_functions.h>
#include "txring_functions.h" // BP-02: txRingDepth() declaration
#include <udp_functions.h>
#include <web_functions/web_functions.h>
#include <phone_commands.h>
#include <mheard_functions.h>
#include <clock.h>

#include <bmx280.h>
#include "bmp390.h"
#include "aht20.h"
#include "bme680.h"
#include "mcu811.h"
#include "io_functions.h"
#include "ina226_functions.h"
#include "rtc_functions.h"
#include "softser_functions.h"

#include <onewire_functions.h>

#include "printfdeb_functions.h"

#include <SparkFun_u-blox_GNSS_Arduino_Library.h>
SFE_UBLOX_GNSS myGPS;

// UBLOX Modul auf Factory-Set zurück setzen
// derzeit nur im esp32_gps realisiert
// nrf52 fehlt diese Funktion noch
// Diese Variablen werden durch das Command --gps reset gesetzt und solten im GPS Modul abgehandelt werden
int state = 0; // only for gps reset
bool bMitHardReset = false;  // only for gps reset

String strTime;
String strDate;

/*
    RAK4631 PIN DEFINITIONS

    static const uint8_t WB_IO1 = 17;	   // SLOT_A SLOT_B
    static const uint8_t WB_IO2 = 34;	   // SLOT_A SLOT_B
    static const uint8_t WB_IO3 = 21;	   // SLOT_C
    static const uint8_t WB_IO4 = 4;	   // SLOT_C
    static const uint8_t WB_IO5 = 9;	   // SLOT_D
    static const uint8_t WB_IO6 = 10;	   // SLOT_D
    static const uint8_t WB_SW1 = 33;	   // IO_SLOT
    static const uint8_t WB_A0 = 5;		   // IO_SLOT
    static const uint8_t WB_A1 = 31;	   // IO_SLOT
    static const uint8_t WB_I2C1_SDA = 13; // SENSOR_SLOT IO_SLOT
    static const uint8_t WB_I2C1_SCL = 14; // SENSOR_SLOT IO_SLOT
    static const uint8_t WB_I2C2_SDA = 24; // IO_SLOT
    static const uint8_t WB_I2C2_SCL = 25; // IO_SLOT
    static const uint8_t WB_SPI_CS = 26;   // IO_SLOT
    static const uint8_t WB_SPI_CLK = 3;   // IO_SLOT
    static const uint8_t WB_SPI_MISO = 29; // IO_SLOT
    static const uint8_t WB_SPI_MOSI = 30; // IO_SLOT

    SPI
    static const uint8_t SS = 26;
    static const uint8_t MOSI = PIN_SPI_MOSI;
    static const uint8_t MISO = PIN_SPI_MISO;
    static const uint8_t SCK = PIN_SPI_SCK;

    // QSPI Pins
    #define PIN_QSPI_SCK 3	// 19
    #define PIN_QSPI_CS 26	// 17
    #define PIN_QSPI_IO0 30 // 20
    #define PIN_QSPI_IO1 29 // 21
    #define PIN_QSPI_IO2 28 // 22
    #define PIN_QSPI_IO3 2	// 23

    @note RAK5005-O GPIO mapping to RAK4631 GPIO ports
   RAK5005-O <->  nRF52840
   IO1       <->  P0.17 (Arduino GPIO number 17)
   IO2       <->  P1.02 (Arduino GPIO number 34)
   IO3       <->  P0.21 (Arduino GPIO number 21)
   IO4       <->  P0.04 (Arduino GPIO number 4)
   IO5       <->  P0.09 (Arduino GPIO number 9)
   IO6       <->  P0.10 (Arduino GPIO number 10)
   SW1       <->  P0.01 (Arduino GPIO number 1)
   A0        <->  P0.04/AIN2 (Arduino Analog A2
   A1        <->  P0.31/AIN7 (Arduino Analog A7
   SPI_CS    <->  P0.26 (Arduino GPIO number 26)

    */

