icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
/*
Sync Word Setting in MeshCom
    MeshCom Syc Word is 0x2b

    Output of the LoRa Sync Word Register 0x0740 in MeshCom:

    Set radio: power level=22
    Sync Word 1st byte = 24
    Sync Word 2nd byte = b4

    In our Library it gets set at sx126x.h / radio.cpp
    Define: sx126x.h line 109:
    #define LORA_MAC_PUBLIC_SYNCWORD 0x242b

    Radio.SetCustomSyncWord(0x242b); needs to be called, so syncword gets new set in radio.cpp
    Method
*/

//NVIC_SystemReset(); resets the device

asm(".global _scanf_float");
asm(".global _printf_float");

// LoRa Events and Buffers
static RadioEvents_t RadioEvents;

// flag to indicate if we are after receiving
unsigned long iReceiveTimeOutTime = 0;

// CSMA/CA async CAD state
std::atomic<bool> cad_done_flag{false};
std::atomic<bool> cad_channel_busy{false};
std::atomic<bool> cad_in_progress{false};
std::atomic<bool> cad_double_check{false};
unsigned long cad_start_time = 0;

bool g_meshcom_initialized;
bool init_flash_done=false;

// FreeRTOS queue of raw BLE payloads, filled by bleuart_rx_callback() in
// nrf52_ble.cpp (BLE task context) and drained below in nrf52loop() so
// readPhoneCommand()/commandAction()/save_settings() run in the Main Loop
// task instead of inline in the BLE callback (CONC-14). Struct layout must
// stay in sync with the definition in nrf52_ble.cpp.
struct BleQueueItem {
    uint8_t data[MAX_MSG_LEN_PHONE];
    size_t length;
};
extern QueueHandle_t bleQueue;

bool bPosFirst = true;
bool bHeyFirst = true;

// Queue for sending config jsons to phone
uint8_t iPhoneState = 0;
bool config_to_phone_prepare = false;
bool conffin_sent = false;
unsigned long config_to_phone_prepare_timer = 0;
unsigned long config_to_phone_datetime_timer = 0;
const uint8_t json_configs_cnt = 9;
const char config_cmds[json_configs_cnt][20] = {"--info", "--seset", "--wifiset", "--nodeset", "--wx", "--pos", "--aprsset", "--io", "--tel"};
uint8_t config_cmds_index = 0;

/**
 * BLE Spec
 * Messages to and from the phone need to have flag if it is a Text, Pos Msg or it is a configuration
 * Text/Pos flag: 0x40
 * Config Flag: 0x80
 * 
 * Config Message Parameters: Callsign, Lat, Lon, altitude
 * Text/Pos Msg Format:
 * LENGTH 2B - FLAG 1B - MSG xB
 * Config Format:
 * LENGTH 2B - FLAG 1B - LENCALL 1B - Callsign - LAT 4B(Float) - LON 4B(Float) - ALT 4B(INT)
 * 
 * Hello Message from Phone is: "XXaaYYzz"
 * Config of this device is sent to phone after hello msg from phone
*/

// Textmessage buffer from phone, hasMsgFromPhone flag indicates new message
extern char textbuff_phone [MAX_MSG_LEN_PHONE];
extern uint8_t txt_msg_len_phone;

extern bool ble_busy_flag;    // flag to signal bluetooth uart is active

//variables and helper functions
uint8_t err_cnt_udp_tx = 0;    // counter on errors sending message via UDP

// CheckSerialConsole
String strTextWork;
char strText[600] = {0};
int iTxtPos = 0;
int iTxtLen = 0;

// TinyGPS
TinyGPSPlus tinyGPSPlus;

int direction_S_N = 0;  //0--S, 1--N
int direction_E_W = 0;  //0--E, 1--W

#if defined(ENABLE_RAK_GPS)
unsigned int getGPS(void);
void SetupUBLOX();
#endif

// TEMP/HUM
Adafruit_SHTC3 shtc3 = Adafruit_SHTC3();

void getTEMP(void);

Adafruit_LPS22 g_lps22hb;

void getPRESSURE(void);

// BME680
#if defined(ENABLE_BMX680)
unsigned long bme680_timer = millis();
int delay_bme680 = 0;
#endif


#define POWER_ENABLE   WB_IO2

#define LEFT_BUTTON    WB_IO3
#define MIDDLE_BUTTON  WB_IO5
#define RIGHT_BUTTON   WB_IO6

uint8_t gKeyNum = 0; // which button is pressed
int iGPSCount=0;

// left button interrupt handle function
void interruptHandle1()
{
  if(gKeyNum == 0)
  {
    gKeyNum = 1;
  }
}

// middle button interrupt handle function
void interruptHandle2()
{
  if(gKeyNum == 0)
  {
    gKeyNum = 2;
  }
}

// right button interrupt handle function
void interruptHandle3()
{
  if(gKeyNum == 0)
  {
    gKeyNum = 3;
  }
}

#if not defined(BOARD_HELTEC_T114) and not defined(BOARD_T_ECHO)
#include <U8g2lib.h>

//extern U8G2_SH1106_128X64_NONAME_F_HW_I2C u8g2;
extern U8G2 *u8g2;
extern U8G2 u8g2_1;
extern U8G2 u8g2_2;
#endif

// Prototypes
void blinkLED();                                     // blink GREEN
void blinkLED2();                                    // blink BLUE
void blinkLED2();                                    // blink RED

void checkSerialCommand(void);


unsigned long gps_refresh_timer = 0;
unsigned long mcp_refresh_timer = 0;
unsigned long softser_refresh_timer = 0;

// Client basic variables
uint8_t dmac[6];

/** Set the device name, max length is 10 characters */
    char g_ble_dev_name[10] = "MC";

void getMacAddr(uint8_t *dmac)
{
    const uint8_t *src = (const uint8_t *)NRF_FICR->DEVICEADDR;
    dmac[5] = src[0];
    dmac[4] = src[1];
    dmac[3] = src[2];
    dmac[2] = src[3];
    dmac[1] = src[4];
    dmac[0] = src[5]; // | 0xc0; // MSB high two bits get set elsewhere in the bluetooth stack
}

void OnCadDone(bool channelActivityDetected)
{
    // RACE-05 fix: atomic flag update under critical section
    taskENTER_CRITICAL();
    cad_channel_busy = channelActivityDetected;
    cad_done_flag.store(true, std::memory_order_release);
    taskEXIT_CRITICAL();
}

void RadioInit()
{
    Radio.Init(&RadioEvents);
}

///////////////////////////////////////////
void nrf52setup()
{
#if defined NRF52_SERIES || defined ESP32
	// Create the task event semaphore
	g_task_sem = xSemaphoreCreateBinary();
	// Initialize semaphore
	xSemaphoreGive(g_task_sem);
#endif

#if defined(HAS_TFT_114)
    pinMode(PIN_TFT_VDD_CTL, OUTPUT);
    pinMode(PIN_TFT_LEDA_CTL, OUTPUT);
    digitalWrite(PIN_TFT_VDD_CTL, TFT_LEDA_ENABLE);  // TFT VDD
    digitalWrite(PIN_TFT_LEDA_CTL, TFT_VDD_ENABLE); // TFT LEDA

    digitalWrite(LORA_NRSET, HIGH);   // LORA

    SPI_TFT.begin();

    tft1.init(TFT_WIDTH, TFT_HEIGHT);                  // ST7789 240x135
    tft1.setRotation(TFT_ROTATION);
    tft1.setSPISpeed(SPI_FREQUENCY);

    char cvers1[22];
    snprintf(cvers1, sizeof(cvers1), "  FW %s/%-1.1s <%s>", SOURCE_VERSION, SOURCE_VERSION_SUB, getCountry(meshcom_settings.node_country).c_str());
    String  version1 = cvers1;
    displayTFT(" MeshCom 4.0 ", version1, "@BY ICSSW.ORG", "  OE1KBC, OE1KFR",  "  ...starting now", 5000);

#endif

     // LEDs
    #if not defined(BOARD_HELTEC_T114)
        pinMode(LED_GREEN, OUTPUT);
        #ifndef BOARD_RAK4630
        pinMode(LED_RED, OUTPUT);
        #endif
        pinMode(LED_BLUE, OUTPUT);
    #endif

