icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
    //  Initialize the Serial Port for debug output
    time_t timeout = millis();
    Serial.begin(MONITOR_SPEED);
    while (!Serial)
    {
        if ((millis() - timeout) < 2000)
        {
            delay(100);
        }
        else
        {
            break;
        }
    }

    Serial.println("=====================================");
    Serial.println("[INIT] START CLIENT");
    nrf52_heapMinFree = nrf52_getFreeHeap();
    nrf52_heapFree = nrf52_heapMinFree;
    Serial.printf("%s;[HEAP];%lu;%lu;%lu;(init)\n", getTimeString().c_str(),
        (unsigned long)nrf52_getFreeHeap(),
        (unsigned long)nrf52_heapMinFree,
        (unsigned long)nrf52_getMaxFreeBlock());

    // init nach Reboot
    init_loop_function();

    // clear the buffers
    for (int i = 0; i < uint8_t(sizeof(RcvBuffer)); i++)
    {
        RcvBuffer[i] = 0x00;
    }

    for(int ib=0; ib<MAX_RING; ib++)
    {
        memset(own_msg_id[ib], 0x00, 5);
    }

    //clear ringbuffer
    for(int i=0; i<MAX_RING; i++)
    {
        memset(ringBufferLoraRX[i], 0, 4);
    }

    // Initialize mheard list
    initMheard();

	// Initialize battery reading
	init_batt();

	// Get LoRa parameter
	init_flash();

    bool bClear = false;
    if(meshcom_settings.node_cleanflash == 1)
        bClear = true;

    // Geloescht wird nur bei echter Layout-Aenderung, nicht bei jedem neuen
    // Build-Datum. Siehe configuration_global.h.
    if(!flashLayoutCompatible(meshcom_settings.node_fversion) || bClear)
    {
        Serial.printf("[INIT]...FLASH cleared, Settings-Layout %i -> %i\n",
                      meshcom_settings.node_fversion, FLASH_STRUCT_VERSION);

        flash_reset();
    }
    else
    {
        Serial.printf("[INIT]...FLASH layout %i ok, build %i\n",
                      meshcom_settings.node_fversion, FLASH_VERSION);
    }

    if(bClear)
        init_flash();

    meshcom_settings.node_fversion = FLASH_STRUCT_VERSION;
    meshcom_settings.node_mversion = MODUL_HARDWARE;
    meshcom_settings.node_cleanflash = 0;
    snprintf(meshcom_settings.node_fwversion, sizeof(meshcom_settings.node_fwversion), "%-4.4s%-1.1s", SOURCE_VERSION, SOURCE_VERSION_SUB);

    // "-0" und "-01" sind nicht die kanonische Schreibweise der SSID. Was aus
    // dem Flash kommt, wird deshalb einmal beim Start geradegezogen -- das
    // save_settings() darunter schreibt es ohnehin. Ein Rufzeichen ohne SSID
    // bleibt, wie es ist. Die Werkseinstellung bleibt unberuehrt, sie soll weiter als
    // "noch nicht konfiguriert" erkennbar sein.
    if(!isNodeUnconfigured(meshcom_settings.node_call))
    {
        String sOwnCall = meshcom_settings.node_call;

        if(normalizeOwnCall(sOwnCall) && strcmp(sOwnCall.c_str(), meshcom_settings.node_call) != 0)
        {
            Serial.printf("[INIT]...Call <%s> -> <%s> (SSID kanonisch)\n", meshcom_settings.node_call, sOwnCall.c_str());

            snprintf(meshcom_settings.node_call, sizeof(meshcom_settings.node_call), "%s", sOwnCall.c_str());
            snprintf(meshcom_settings.node_short, sizeof(meshcom_settings.node_short), "%s", convertCallToShort(meshcom_settings.node_call).c_str());
        }
    }
    
    save_settings();

    meshcom_settings.node_date_hour = 0;
    meshcom_settings.node_date_minute = 0;
    meshcom_settings.node_date_second = 0;
    meshcom_settings.node_date_hundredths = 0;

    meshcom_settings.node_date_year = 0;
    meshcom_settings.node_date_month = 0;
    meshcom_settings.node_date_day = 0;

    bDisplayVolt = meshcom_settings.node_sset & 0x0001;
    bDisplayOff = meshcom_settings.node_sset & 0x0002;
    bPosDisplay = meshcom_settings.node_sset & 0x0004;
    bDEBUG = meshcom_settings.node_sset & 0x0008;
    bButtonCheck = meshcom_settings.node_sset & 0x0010;
    bDisplayTrack = meshcom_settings.node_sset & 0x0020;
    bGPSON =  meshcom_settings.node_sset & 0x0040;
    bBMPON =  meshcom_settings.node_sset & 0x0080;
    bBMEON =  meshcom_settings.node_sset & 0x0100;
    bLORADEBUG = meshcom_settings.node_sset & 0x0200;
    bSHORTPATH = meshcom_settings.node_sset & 0x0400;
    bGATEWAY =  meshcom_settings.node_sset & 0x1000;
    bEXTUDP =  meshcom_settings.node_sset & 0x2000;
    bDisplayCont =  meshcom_settings.node_sset & 0x4000;

    // TRK-01: Warnhinweis einmal beim Boot, wenn Track aus den Settings aktiv geladen wurde
    if(bDisplayTrack)
        Serial.printf("[INIT]..." TRACK_WARNING_SERIAL "\n");

    bONEWIRE =  meshcom_settings.node_sset2 & 0x0001;
    bLPS33 =  meshcom_settings.node_sset2 & 0x0002;
    bBME680ON = meshcom_settings.node_sset2 & 0x0004;
    bMCU811ON =  meshcom_settings.node_sset2 & 0x0008;
    //bGPSDEBUG = meshcom_settings.node_sset2 & 0x0010;
    iGPSDEBUG = meshcom_settings.node_gpsdebug;
    bMESH = !(meshcom_settings.node_sset2 & 0x0020);
    bWEBSERVER = meshcom_settings.node_sset2 & 0x0040;
    bWIFIAP = meshcom_settings.node_sset2 & 0x0080;
    bGATEWAY_NOPOS =  meshcom_settings.node_sset2 & 0x0100;
    bSMALLDISPLAY =  false;
    //free !! meshcom_settings.node_sset2 & 0x0200;
    bSOFTSERON =  meshcom_settings.node_sset2 & 0x0400;
    bBOOSTEDGAIN =  meshcom_settings.node_sset2 & 0x0800;
    //xxxxx = meshcom_settings.node_sset2 & 0x2000;
    bVIA = meshcom_settings.node_sset2 & 0x4000;

    // nicht mehr notwendig bMHONLY =  meshcom_settings.node_sset3 & 0x0001;
    bNoMSGtoALL =  meshcom_settings.node_sset3 & 0x0002;
    bBLEDEBUG = meshcom_settings.node_sset3 & 0x0004;
    bAnalogCheck = meshcom_settings.node_sset3 & 0x0008;
    bBMP3ON = meshcom_settings.node_sset3 & 0x0010;
    bAHT20ON = meshcom_settings.node_sset3 & 0x0020;

    bDEBUGCSV = meshcom_settings.node_sset4 & 0x0001;
    bDEBUGEN = meshcom_settings.node_sset4 & 0x0002;
    bDisplayLog = meshcom_settings.node_sset4 & 0x0004;
    bTXCAPTURE = meshcom_settings.node_sset4 & 0x0008;

    bDisplayInfo = bLORADEBUG;

    if(strlen(meshcom_settings.node_aprsmc) < 4)
    {
        strcpy(meshcom_settings.node_aprsmc, (char*)"APRSMC");  // default
    }

    // CS-01: max_hop_text is user-settable (--maxhop) and survives in the settings
    // file now; only a missing or out-of-range value falls back to the compile
    // default. max_hop_pos stays a compile-time constant (operator, 2026-08-30).
    meshcom_settings.max_hop_text = maxHopTextSanitize(meshcom_settings.max_hop_text);
    meshcom_settings.max_hop_pos = MAX_HOP_POS_DEFAULT;

    iButtonPin = BUTTON_PIN;
    if(meshcom_settings.node_button_pin > 0)
        iButtonPin = meshcom_settings.node_button_pin;

    // user button init
    init_onebutton();

    // if Node not set --> WifiAP Mode on
    /* NRF52 no WiFi
    if(isNodeUnconfigured(meshcom_settings.node_call))
    {
        bWIFIAP = true;
        bWEBSERVER = true;

        Serial.println("WIFIAP starting...");
    }
    */

    if(meshcom_settings.node_gwsrv[0] == 0x00)
        snprintf(meshcom_settings.node_gwsrv, sizeof(meshcom_settings.node_gwsrv), "%s", "OE");

    // if Node is in WifiAP Mode -> no Gateway posible
    if(bWIFIAP && bGATEWAY)
    {
        bGATEWAY=false;
        bEXTUDP=false;
    }

    if(bBMPON)
    {
        bBMEON=false;
        bBME680ON=false;
        bmx_found=false;
    }
    else
    if(bBMEON)
    {
        bBMPON=false;
        bBME680ON=false;
        bmx_found=false;
    }

    bme680_found=false;

