icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
    // I2C init
    #if not defined(USE_HELTEC_T114)
        Wire.begin();
    #endif

    #if defined(ENABLE_BMX280)
        setupBMX280(true);
    #endif

    #if defined(ENABLE_AHT20)
        setupAHT20(true);
    #endif

    #if defined(ENABLE_MC811)
        setupMCU811();
    #endif

    // BME680
    #if defined(ENABLE_BMX680)
        setupBME680();
    #endif

    // MCP23017
    #if defined(ENABLE_MCP23017)
        setupMCP23017();
    #endif

    // INA226
    #if defined(ENABLE_INA226)
        setupINA226();
    #endif

    // RTC
    #if defined(ENABLE_RTC)
        setupRTC();
    #endif

    // SOFTSER
    #if defined(ENABLE_SOFTSER)
        setupSOFTSER();
    #endif

    #if defined(BOARD_T_ECHO)
        initDisplay();
        startDisplay((char*)"..starting now..", (char*)"@by icssw.org", (char*)"OE1KBC, OE1KFR");
    
    #elif defined(HAS_EPAPER)

    #elif defined(HAS_TFT_114)
        char cvers[22];
        snprintf(cvers, sizeof(cvers), "  FW %s/%-1.1s <%s>", SOURCE_VERSION, SOURCE_VERSION_SUB, getCountry(meshcom_settings.node_country).c_str());
        String  version = cvers;
        displayTFT(" MeshCom 4.0", version, "@BY ICSSW.ORG", "   OE1KBC, OE1KFR",  "   ...starting now", 5000);
    #elif defined(HAS_TFT)
        initTFT();
        char cvers[22];
        snprintf(cvers, sizeof(cvers), "  FW %s/%-1.1s <%s>", SOURCE_VERSION, SOURCE_VERSION_SUB, getCountry(meshcom_settings.node_country).c_str());
        String  version = cvers;
        displayTFT(" MeshCom 4.0 ", version, "  @BY ICSSW.ORG", "  OE1KBC, OE1KFR",  "  ...starting now", 5000);
    #else
        initDisplay();
        startDisplay((char*)"..starting now..", (char*)"@by icssw.org", (char*)"OE1KBC, OE1KFR");
    #endif

    // reset GPS-Time parameter
    meshcom_settings.node_date_hour = 0;
    meshcom_settings.node_date_minute = 0;
    meshcom_settings.node_date_second = 0;
    meshcom_settings.node_date_hundredths = 0;

    Serial.println("[INIT]...CLIENT STARTED");

    // Reset-Ursache loggen (POWER->RESETREAS, vom Core beim Start gesichert):
    // 0x1 Reset-Pin, 0x2 Watchdog, 0x4 Soft-Reset (SREQ — auch der Weg, den
    // der SoftDevice-Fault-Handler nach einem App-Absturz nimmt), 0x8 Lockup.
    // Unterscheidet nach einem unerwarteten Reboot sofort Absturz von
    // Spannungsproblem — haette die N-22-Diagnose erheblich verkuerzt.
    {
        extern uint32_t readResetReason(void);
        Serial.printf("[BOOT] RESETREAS=0x%08lX\n", (unsigned long)readResetReason());
    }


    Radio.SetModem(MODEM_LORA);

    Serial.printf("[INIT]...Radio-Sync: %04X\n", Radio.GetSyncWord());

    //  Set the LoRa Callback Functions
    RadioEvents.TxDone = OnTxDone;
    RadioEvents.RxDone = OnRxDone;
    RadioEvents.TxTimeout = OnTxTimeout;
    RadioEvents.RxTimeout = OnRxTimeout;
    RadioEvents.RxError = OnRxError;
    RadioEvents.CadDone = OnCadDone;
    //RadioEvents.PreAmpDetect = OnPreambleDetect;
    RadioEvents.PreAmpDetect = OnHeaderDetect;

    // 4.34w we use EU8 instead of EU
    if(meshcom_settings.node_country == 0)
        meshcom_settings.node_country = 8;

    lora_setcountry(meshcom_settings.node_country);

    //  Initialize the LoRa Transceiver
    RadioInit();

    // Sets the Syncword new that we can set the MESHCOM SWORD
    DEBUG_MSG("RADIO", "Setting new LoRa Sync Word");
    Radio.SetCustomSyncWord(0x242b);

    // set bandwidth 
    Serial.printf("[LoRa]...RF_BANDWIDTH: %.0f kHz\n", getBW());

    // set spreading factor 
    Serial.printf("[LoRa]...RF_SF: %i\n",  getSF());

    // coding rate
    Serial.printf("[LoRa]...RF_CR: 4/%i\n", getCR());

    // set carrier frequency
    uint32_t ifreq=(getFreq()*1000.)+0.5;
    ifreq = ifreq * 1000;

    Serial.printf("[LoRa]...RF_FREQUENCY: %.4f %ld MHz\n", getFreq(), ifreq);

    //  Set the LoRa Frequency
    Radio.SetChannel(ifreq);

    Serial.printf("[LoRa]...PREAMBLE: %i symbols\n", meshcom_settings.node_preamplebits);

    uint16_t preamble_length = meshcom_settings.node_preamplebits;

    //  Configure the LoRa Transceiver for receiving messages
    Radio.SetRxConfig(
        MODEM_LORA,
        (uint32_t)meshcom_settings.node_bw,
        (uint32_t)meshcom_settings.node_sf,
        (uint8_t)meshcom_settings.node_cr,
        0, //  AFC bandwidth: Unused with LoRa
        preamble_length,
        LORA_SYMBOL_TIMEOUT,
        LORA_FIX_LENGTH_PAYLOAD_ON,
        0,    //  Fixed payload length: N/A
        true, //  CRC enabled
        0,    //  Frequency hopping disabled
        0,    //  Hop period: N/A
        LORA_IQ_INVERSION_ON,
        true //  Continuous receive mode
    );

    // Set Radio TX configuration
    meshcom_settings.node_power = resolve_tx_power(meshcom_settings.node_power, TX_OUTPUT_POWER); // #1132: normalize -20/0 sentinel like ESP32 does
    Serial.printf("[LoRa]...RF_POWER: %i dBm\n", getPower());

    Radio.SetTxConfig(
        MODEM_LORA,
        getPower(),
        0, // fsk only
        (uint32_t)meshcom_settings.node_bw,
        (uint32_t)meshcom_settings.node_sf,
        (uint8_t)meshcom_settings.node_cr,
        preamble_length,
        LORA_FIX_LENGTH_PAYLOAD_ON,
        true, // CRC ON
        0,    // fsk only frequ hop
        0,    // fsk only frequ hop period
        LORA_IQ_INVERSION_ON,
        TX_TIMEOUT_VALUE);

    Serial.printf("[INIT]...Radio-Sync: %04X\n", Radio.GetSyncWord());

    //  Start receiving LoRa packets
    startRadioReceive();

    // Configure CAD parameters: 4 symbols, DETPEAK/DETMIN from config, CAD_ONLY mode
    Radio.SetCadParams(LORA_CAD_04_SYMBOL, RADIOLIB_SX126X_DETPEAK, RADIOLIB_SX126X_DETMIN, LORA_CAD_ONLY, 0);

    // set left button interrupt
    //pinMode(LEFT_BUTTON, INPUT);
    //attachInterrupt(LEFT_BUTTON, interruptHandle1, FALLING);

    // set middle button interrupt
    pinMode(MIDDLE_BUTTON, INPUT);
    attachInterrupt(MIDDLE_BUTTON, interruptHandle2, FALLING);

    // set right button interrupt
    //pinMode(RIGHT_BUTTON, INPUT);
    //attachInterrupt(RIGHT_BUTTON, interruptHandle3, FALLING);

