icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
    sd_power_mode_set(NRF_POWER_MODE_CONSTLAT);

    Serial.println("=====================================");

    delay(100);

    if (bGATEWAY || bWEBSERVER)
    {
        //////////////////////////////////////////////////////
        // ETHERNET INIT
   
        if(strlen(meshcom_settings.node_ownip) > 6 && strlen(meshcom_settings.node_ownms) > 6 && strlen(meshcom_settings.node_owngw) > 6)
        {
            if(bDEBUG)
                Serial.println("[init] ETH FIX-IP init");

            neth.initethfixIP();
        }
        else
        {
            if(bDEBUG)
                Serial.println("[init] ETH DHCP init");

            neth.initethDHCP();
        }

        if(neth.hasETHHardware)
        {
            if(bGATEWAY)
            {
                sendHeartbeat();

                Serial.println("=====================================");
                Serial.printf("GATEWAY 4.0 RUNNING %s\n", neth.hasIPaddress?"ETH connect":"ETH no connect");
                Serial.println("=====================================");
            }

            if(bWEBSERVER)
            {
                startWebserver();
            }

            if(bEXTUDP)
            {
                startExternUDP();
            }
        }
        else
        {
            meshcom_settings.node_hasIPaddress = false;

            Serial.println("==================================");
            Serial.println("CLIENT 4.0 RUNNING no ETH-Hardware");
            Serial.println("==================================");
        }
    }
    else
    {
        meshcom_settings.node_hasIPaddress = false;
        neth.hasETHHardware = false;
    }
}   

void nrf52loop()
{
    INSTR_LOOPTICK();

    // BP-01/BP-04: close a back-pressure episode with QRV once the TX ring
    // has drained, even when no further user message arrives to observe it.
    // Since BP-02 an occupied-slot scan (O(MAX_RING)), since BP-04 with the
    // water-band hold; it emits at most once per episode.
    bpPollDrain();

    // TM-25: Boot-Marke fuer den Bench-Harness, wie [BOOT];ready auf dem ESP32.
    // Auf dem nRF52 ist die Netzwerkphase (W5100S/DHCP) am Ende von setup()
    // bereits synchron abgeschlossen -- die Marke faellt beim ersten Loop-Durchlauf.
    static bool s_bootReadyLogged = false;
    if (!s_bootReadyLogged)
    {
        s_bootReadyLogged = true;
        Serial.printf("[BOOT];ready;ms;%lu;ip;%d;eth;%d\n", (unsigned long)millis(),
                      neth.hasIPaddress ? 1 : 0, neth.hasETHHardware ? 1 : 0);
    }
    #if defined(HAS_TFT_114) or defined(BOARD_T_ECHO)
    if(bDEEP_SLEEP)
    {
        delay(60000);
        // only loop
    }
    else
    {
    #endif

    // get RTC Now
    // RTC hat Vorrang zu Zeit via MeshCom-Server
    bool bMyClock = true;

    #if defined(ENABLE_RTC)
    if(bRTCON)
    {
        bMyClock = false;

        { INSTR_SECTION("rtc"); loopRTC(); }

        if(!posinfo_fix) // GPS hat Vorang zur RTC
        {
            DateTime utc = getRTCNow();

            DateTime now (utc + TimeSpan(meshcom_settings.node_utcoff * 60 * 60));

            uint16_t Year = now.year();
            uint16_t Month = now.month();
            uint16_t Day = now.day();

            uint16_t Hour = now.hour();
            uint16_t Minute = now.minute();
            uint16_t Second = now.second();


            // check valid Date & Time
            if(Year > 2023)
            {
                MyClock.setCurrentTime(meshcom_settings.node_utcoff, Year, Month, Day, Hour, Minute, Second);
                snprintf(cTimeSource, sizeof(cTimeSource), (char*)"RTC");
                bMyClock = true;
            }
        }
    }
    #endif

    if(meshcom_settings.node_hasIPaddress)
    {
        INSTR_SECTION("eth_state");
        strTime = "none";

        extern bool btimeClient;

        // every 15 minutes
        if(btimeClient)
        {
            if((uint32_t)(millis() - updateTimeClient) >= (uint32_t)(1000 * 60 * 15) || updateTimeClient == 0)
            {
                strTime = neth.udpUpdateTimeClient();

                updateTimeClient = millis();
            }
            else
                strTime = neth.udpGetTimeClient();

            strDate = neth.udpGetDateClient();

            uint16_t Year = (uint16_t)strDate.substring(0, 4).toInt();
            uint16_t Month = (uint16_t)strDate.substring(5, 7).toInt();
            uint16_t Day = (uint16_t)strDate.substring(8, 10).toInt();

            uint16_t Hour = (uint16_t)strTime.substring(0, 2).toInt();
            uint16_t Minute = (uint16_t)strTime.substring(3, 5).toInt();
            uint16_t Second = (uint16_t)strTime.substring(6, 8).toInt();
        
            // check valid Date & Time
            if(Year > 2023 && strTime.compareTo("none") != 0)
            {
                MyClock.setCurrentTime(meshcom_settings.node_utcoff, Year, Month, Day, Hour, Minute, Second);
                bNTPDateTimeValid = true;

                snprintf(cTimeSource, sizeof(cTimeSource), (char*)"NTP");
            }
            else
                bNTPDateTimeValid = false;
        }
    }
    else
    {
        bNTPDateTimeValid = false;
    }


    if(bMyClock)
    {
        INSTR_SECTION("clock");
        MyClock.CheckEvent();
        
        if(MyClock.Year() > 2023)
            meshcom_settings.node_date_year = MyClock.Year();
        else
            meshcom_settings.node_date_year = 0;

        meshcom_settings.node_date_month = MyClock.Month();
        meshcom_settings.node_date_day = MyClock.Day();

        meshcom_settings.node_date_hour = MyClock.Hour();
        meshcom_settings.node_date_minute = MyClock.Minute();
        meshcom_settings.node_date_second = MyClock.Second();

        // Starttime setzen
        if(meshcom_settings.node_date_year > 2023 && meshcom_settings.node_update[0] == 0x00)
        {
            snprintf(meshcom_settings.node_update, sizeof(meshcom_settings.node_update), "%04i-%02i-%02i %02i:%02i:%02i",
             meshcom_settings.node_date_year, meshcom_settings.node_date_month, meshcom_settings.node_date_day, meshcom_settings.node_date_hour, meshcom_settings.node_date_minute, meshcom_settings.node_date_second);
        }
    }

