icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
    // Retransmission status must tick on ALL nodes (including gateways).
    // Without this, gateway text messages stay stuck at RING_STATUS_SENT
    // forever if no echo is received via LoRa (RING_ZOMBIE).
    if ((uint32_t)(millis() - retransmit_timer) >= (1000 * 2))
    {
        updateRetransmissionStatus();
        // BP-03 (DJ8MEH-RCA): age out stale BACKGROUND (HEY) ring entries
        // here, in the main-loop tick -- NOT in getNextTxSlot(), which also
        // runs on the nRF52 timer task itself (Advisor F1, the critical
        // finding this fix is named after).
        txRingAgeBackground(millis());

        retransmit_timer = millis();
    }

    // Periodischer Ringpuffer-Auslastungsbericht (alle 30s)
    {
        static unsigned long ring_status_timer = 0;
        if(bLORADEBUG && (millis() - ring_status_timer) > 30000)
        {
            ring_status_timer = millis();
            int pending = 0, retrying = 0, done = 0;
            for(int i = 0; i < MAX_RING; i++)
            {
                if(ringBuffer[i][0] == 0) continue;
                if(ringBuffer[i][1] == 0xFF) done++;
                else if(ringBuffer[i][1] == 0x00) pending++;
                else retrying++;
            }
            int w = iWrite;
            int r = iRead;
            // BP-02: queued is now the honest occupied-slot count (the
            // pending/retrying/done buckets above already scan every slot
            // and partition it exactly) instead of the raw index distance --
            // that distance counted freed holes left behind by a
            // priority-starved entry parked at iRead as still queued
            // (DJ8MEH-RCA: queued=19 vs. 3-4 real). The old arithmetic
            // survives as `dist` below for anyone comparing against
            // pre-BP-02 logs.
            int queued = pending + retrying + done;
            int dist = (w >= r) ? (w - r) : (MAX_RING - r + w);
            Serial.printf("[MC-DBG] RING_STATUS queued=%d pending=%d retrying=%d done=%d iW=%d iR=%d dist=%d\n",
                queued, pending, retrying, done, w, r, dist);
        }
    }

    // Deferred display update from OnRxDone (avoid I2C inside radio callback)
    // RACE-01 fix: snapshot under critical section, display call outside
    {
        taskENTER_CRITICAL();
        bool _pendText = bPendingDisplayText;
        bool _pendPos = bPendingDisplayPos;
        struct aprsMessage _msg;
        int16_t _rssi = 0;
        int8_t _snr = 0;
        if(_pendText || _pendPos) {
            _msg = pendingDisplayMsg;
            _rssi = pendingDisplayRssi;
            _snr = pendingDisplaySnr;
            bPendingDisplayText = false;
            bPendingDisplayPos = false;
        }
        taskEXIT_CRITICAL();
        INSTR_SECTION("display_rx");
        if(_pendText) sendDisplayText(_msg, _rssi, _snr);
        if(_pendPos)  sendDisplayPosition(_msg, _rssi, _snr);
    }

    // Channel utilization report (every 10s). SL-05: the drain of the
    // ch_util accumulators feeds stat_util_rx_5m/tx_5m for the STAT line
    // (--setlog on), so the 10-s tick runs independent of bLORADEBUG; only
    // the diagnostic prints stay behind the flag, unchanged.
    {
        static unsigned long ch_util_timer = 0;
        if((millis() - ch_util_timer) > 10000)
        {
            unsigned long window = millis() - ch_util_timer;
            ch_util_timer = millis();
            unsigned long rx_ms = ch_util_rx_accum.exchange(0);
            unsigned long tx_ms = ch_util_tx_accum.exchange(0);
            stat_util_rx_5m += (uint32_t)rx_ms;
            stat_util_tx_5m += (uint32_t)tx_ms;
            unsigned int util = (unsigned int)((rx_ms + tx_ms) * 100 / window);
            if(util > 100) util = 100;
            if(bLORADEBUG)
            {
                Serial.printf("[MC-DBG] CHANNEL_UTIL rx=%lums tx=%lums util=%u%%\n",
                    rx_ms, tx_ms, util);
                // ONRXDONE stats: report max and warn count, then reset
                Serial.printf("[MC-DBG] ONRXDONE_STATS max=%lums warn=%u (>%dms)\n",
                    onrxdone_max_ms, onrxdone_warn_count, ONRXDONE_WARN_MS);
                onrxdone_max_ms = 0;
                onrxdone_warn_count = 0;
            }
        }
    }

    // SL-05 STAT tick (--setlog on / bDisplayLog): runs independent of
    // bLORADEBUG so the interval counters never grow unbounded even when the
    // block above never fires. Reset always, print only when enabled.
    {
        static uint32_t setlog_stat_timer = 0;
        if((uint32_t)(millis() - setlog_stat_timer) >= PRIO_STAT_INTERVAL_S * 1000UL)
        {
            setlog_stat_timer = millis();

            struct setlogStatFields f;
            setlogFillStat(&f, nrf52_getFreeHeap());

            // stat_drop_count[] increments happen under this same lock in
            // txring_functions.cpp -- clear under it too, right after the
            // (uncleared) read inside setlogFillStat().
            taskENTER_CRITICAL();
            for(int i = 0; i < 5; i++)
                stat_drop_count[i + 1] = 0;
            taskEXIT_CRITICAL();

            if(bDisplayLog)
            {
                char buf[300];
                setlogFormatStat(buf, sizeof(buf), &f);
                setlogPrint(buf);
            }
        }
    }

    if(iReceiveTimeOutTime > 0)
    {
        INSTR_SECTION("lora_rx_timeout");
        if((uint32_t)(millis() - iReceiveTimeOutTime) >= (uint32_t)csma_timeout)
        {
            if(bLORADEBUG)
                Serial.printf("[MC-DBG] RX_TIMEOUT_FIRE ts=%lu wait=%lu delta=%lu\n",
                    millis(), csma_timeout, millis() - iReceiveTimeOutTime);

            // BUG #1 Aequivalent: Wenn Header erkannt, ist Empfang moeglicherweise
            // noch aktiv. Timer verlaengern statt zuruecksetzen.
            if(is_receiving && rx_irq_defer_count < 3)
            {
                rx_irq_defer_count++;
                iReceiveTimeOutTime = millis();
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] RX_TIMEOUT_DEFERRED src=is_receiving cnt=%d\n", rx_irq_defer_count);
            }
            else
            {
                if(rx_irq_defer_count >= 3 && bLORADEBUG)
                    Serial.printf("[MC-DBG] RX_IRQ_STALE forced restart after %d deferrals\n", rx_irq_defer_count);
                rx_irq_defer_count = 0;
                iReceiveTimeOutTime = 0;
                taskENTER_CRITICAL();
                startRadioReceive();
                taskEXIT_CRITICAL();
                if(bLORADEBUG)
                {
                    Serial.printf("[MC-SM] IDLE -> RX_LISTEN rc=0\n");
                    Serial.printf("[MC-DBG] RX_RESTART src=timeout\n");
                }
            }
        }
    }

    if(iReceiveTimeOutTime == 0 && is_receiving == false && tx_is_active == false)
    {
        INSTR_SECTION("lora_sm");
        int _w = iWrite;
        int _r = iRead;
        if (_w != _r)
        {
            // RACE-05 fix: snapshot CAD flags under critical section,
            // then act on snapshot values outside the lock
            taskENTER_CRITICAL();
            bool _cad_ip = cad_in_progress;
            bool _cad_df = cad_done_flag;
            bool _cad_cb = cad_channel_busy;
            bool _cad_dc = cad_double_check;
            taskEXIT_CRITICAL();

            if(!_cad_ip && !_cad_df)
            {
                // Start CAD scan
                // BP-02: qlen is txRingDepth() (occupied slots), not the raw
                // index distance -- see txRingDepth() doc comment.
                if(bLORADEBUG)
                {
                    Serial.printf("[MC-SM] IDLE -> TX_PREPARE rc=0\n");
                    Serial.printf("[MC-DBG] TX_GATE_ENTER qlen=%d cad_attempt=%d\n",
                        txRingDepth(),
                        cad_attempt);
                }

