icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
                taskENTER_CRITICAL();
                cad_in_progress = true;
                cad_done_flag = false;
                cad_double_check = false;
                cad_start_time = millis();
                taskEXIT_CRITICAL();
                taskENTER_CRITICAL();
                Radio.Standby();
                Radio.StartCad();
                taskEXIT_CRITICAL();
            }
            else if(_cad_df)
            {
                taskENTER_CRITICAL();
                cad_in_progress = false;
                cad_done_flag = false;
                taskEXIT_CRITICAL();
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] CAD_SCAN result=%d\n", _cad_cb ? -702 : 0);

                if(!_cad_cb)
                {
                    if(_cad_dc && bLORADEBUG)
                        Serial.printf("[MC-DBG] CAD_FALSE_POSITIVE\n");
                    // Channel free — transmit
                    csma_reset();
                    bool _tx_ok;
                    { INSTR_SECTION("lora_tx"); _tx_ok = doTX(); }
                    if(_tx_ok)
                    {
                        ch_util_tx_start = millis();
                        if(bLORADEBUG)
                        {
                            Serial.printf("[MC-SM] TX_PREPARE -> TX_ACTIVE rc=0\n");
                            Serial.printf("[MC-DBG] CAD_FREE attempt=%d\n", cad_attempt);
                        }
                    }
                    else
                    {
                        // doTX() returned false (no ready slot) — restore RX
                        // to prevent CAD spin loop where radio stays in standby
                        if(bLORADEBUG)
                            Serial.printf("[MC-DBG] CAD_FREE_NO_TX restoring RX\n");
                        taskENTER_CRITICAL();
                        startRadioReceive();
                        taskEXIT_CRITICAL();
                        iReceiveTimeOutTime = millis();
                    }
                }
                else if(!_cad_dc)
                {
                    // First scan busy — double-check
                    if(bLORADEBUG)
                        Serial.printf("[MC-DBG] CAD_BUSY_1 attempt=%d, double-check...\n", cad_attempt);

                    taskENTER_CRITICAL();
                    cad_double_check = true;
                    cad_in_progress = true;
                    cad_done_flag = false;
                    cad_start_time = millis();
                    taskEXIT_CRITICAL();
                    taskENTER_CRITICAL();
                    Radio.Standby();
                    Radio.StartCad();
                    taskEXIT_CRITICAL();
                }
                else
                {
                    // Double-check confirmed busy — backoff
                    cad_attempt++;
                    csma_timeout = csma_compute_timeout(cad_attempt);

                    if(bLORADEBUG)
                    {
                        Serial.printf("[MC-SM] TX_PREPARE -> IDLE rc=-1\n");
                        Serial.printf("[MC-DBG] CAD_BUSY attempt=%d next_timeout=%lu\n",
                            cad_attempt, csma_timeout);
                    }

                    taskENTER_CRITICAL();
                    startRadioReceive();
                    taskEXIT_CRITICAL();
                    iReceiveTimeOutTime = millis();
                }
            }
            else if(_cad_ip && (millis() - cad_start_time > 100))
            {
                // Safety timeout: CadDone never fired
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] CAD_SAFETY_TIMEOUT\n");

                taskENTER_CRITICAL();
                cad_in_progress = false;
                cad_done_flag = false;
                taskEXIT_CRITICAL();
                taskENTER_CRITICAL();
                startRadioReceive();
                taskEXIT_CRITICAL();
                iReceiveTimeOutTime = millis();
            }
        }
        else
        {
            // Nothing to send — restart timeout cycle (radio watchdog).
            // Matches ESP32 esp32_main.cpp behaviour: periodic Radio.Rx()
            // prevents silent SX1262 stall when queue is empty.
            iReceiveTimeOutTime = millis();
        }
    }

    #if defined(ENABLE_GPS)
    if(bGPSON)
    {
        INSTR_SECTION("gps_init");
        WZ_GPS_Init();
    }
    #endif

    // SOFTSER
    #if defined(ENABLE_SOFTSER)
    if(bSOFTSERON)
    {
        INSTR_SECTION("softser");
        // check every 5 seconds to ready next telemetry via serial interface
        if ((uint32_t)(millis() - softser_refresh_timer) >= 5000 && softserFunktion == 0)
        {
            if(lastSOFTSER_MINUTE != meshcom_settings.node_date_minute)
            {
                if(meshcom_settings.node_date_minute % SOFTSER_REFRESH_INTERVAL  == 0)
                {
                    lastSOFTSER_MINUTE = meshcom_settings.node_date_minute;

                    // start SOFTSER APP
                    loopSOFTSER(SOFTSER_APP_ID);
                }
            }

            softser_refresh_timer = millis();
        }
        else
        if (bSOFTSER_APP)
        {
            bSOFTSER_APP = false;

            softserFunktion = 0;

            lastSOFTSER_MINUTE = meshcom_settings.node_date_minute;
            
            // start SOFTSER APP
            loopSOFTSER(SOFTSER_APP_ID);
        }
        else
        {
            appSOFTSER(SOFTSER_APP_ID);
        }
    }
    #endif

    btn.tick();

    // BLE Queue: process data from the BLE task in Main Loop context (CONC-14)
    {
        BleQueueItem bleItem;
        while (xQueueReceive(bleQueue, &bleItem, 0) == pdTRUE) {
            { INSTR_SECTION("ble_cmd"); readPhoneCommand(bleItem.data); }
        }
    }

    // Apply a settings write staged by settings_rx_callback(), if any (CONC-17)
    { INSTR_SECTION("ble_settings"); applyPendingBleSettings(); }

    // check if message from phone to send
    if(hasMsgFromPhone)
    {
        INSTR_SECTION("phone_msg");
        if(memcmp(textbuff_phone, ":", 1) == 0)
        {
            // BP-01: tag the origin so the back-pressure notice goes back to
            // the phone that just typed, and never over the air.
            setMsgOrigin(ORIGIN_BLE);
            (void)sendMessage(textbuff_phone, txt_msg_len_phone);
            setMsgOrigin(ORIGIN_NONE);
        }

