icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
        if(memcmp(textbuff_phone, "-", 1) == 0)
            commandAction(textbuff_phone, isPhoneReady, true);

        hasMsgFromPhone = false;
    }

    #if defined(ENABLE_MCP23017)
    // 5 sec
    if ((uint32_t)(millis() - mcp_refresh_timer) >= 5000)
    {
        // get i/o state
        if(loopMCP23017())
        {
        }

        mcp_refresh_timer = millis();
    }
    #endif

    #if defined(ENABLE_GPS)
        gKeyNum = 2;
    #endif


    if(gKeyNum == 1)
    {
        INSTR_SECTION("key1");
        Serial.println("gKeyNum == 1");

        //getTEMP();

        //getPRESSURE();

        gKeyNum = 0;
    }

    if(gKeyNum == 2)
    {
        INSTR_SECTION("key2");
        //TEST Serial.println("gKeyNum == 2");

        #if defined(ENABLE_RAK_GPS)
        if(bGPSON)
        {
            // gps refresh every 10 sec
            if ((uint32_t)(millis() - gps_refresh_timer) >= (uint32_t)(GPS_REFRESH_INTERVAL * 1000))
            {
                unsigned int igps = getGPS();

                if(igps > 0)
                    posinfo_interval = igps;
                else
                {
                    no_gps_reset_counter++;
                    if(no_gps_reset_counter > 10)
                    {
                        posinfo_interval = POSINFO_INTERVAL;
                        no_gps_reset_counter = 0;
                    }
                }

                gps_refresh_timer = millis();
            }
        }
        #endif

        #if defined(ENABLE_GPS)
        if(bGPSON)
        {
            if (gpsDetected) { INSTR_SECTION("gps_feed"); WZ_GPS_Feed(); }

            // gps refresh every sec
            if ((uint32_t)(millis() - gps_refresh_timer) >= 1000)
            {
                unsigned int igps = POSINFO_INTERVAL;

                if(gpsDetected)
                {
                    { INSTR_SECTION("gps"); igps = WZ_GPS_Loop(); }

                    if(iGPSDEBUG > 0)
                    {
                        Serial.printf("[GPS ]...fix:%s sat:%i hdop:%.1lf\n", (posinfo_fix?"yes":"no"), gpsData.satellites, gpsData.hdop);

                        Serial.print("[GPS ]...Time <UTC>: ");
                        if (gpsData.hour < 10) Serial.print(F("0"));
                        Serial.print(gpsData.hour);
                        Serial.print(F(":"));
                        if (gpsData.minute < 10) Serial.print(F("0"));
                        Serial.print(gpsData.minute);
                        Serial.print(F(":"));
                        if (gpsData.second < 10) Serial.print(F("0"));
                        Serial.print(gpsData.second);

                        Serial.print(F(" / Date: "));
                        Serial.print(gpsData.year);
                        Serial.print(F("."));
                        if (gpsData.month < 10) Serial.print(F("0"));
                        Serial.print(gpsData.month);
                        Serial.print(F("."));
                        if (gpsData.day < 10) Serial.print(F("0"));
                        Serial.println(gpsData.day);

                        if(posinfo_fix)
                        {
                            Serial.printf("[GPS ]...position  : lat:%.6lf lon:%.6lf alt:%.1lf\n", gpsData.latitude, gpsData.longitude, gpsData.altitude);
                        }

                    }
                }
                
                if(igps > 0)
                    posinfo_interval = igps;
                else
                {
                    no_gps_reset_counter++;
                    if(no_gps_reset_counter > 10)
                    {
                        posinfo_interval = POSINFO_INTERVAL;
                        no_gps_reset_counter = 0;
                    }
                }

                gps_refresh_timer = millis();
            }
        }
        #endif
        
        #if defined(ENABLE_RAK_GPS) || defined(ENABLE_GPS)
        if(bGPSON)
        {
            // check GPS ON and activ --> <gKeyNum == 2> the signal must be active
            if ((uint32_t)(millis() - gps_refresh_timer) >= (uint32_t)(5 * (GPS_REFRESH_INTERVAL * 1000)))
            {
                posinfo_fix = false;
                posinfo_satcount = 0;
                fposinfo_hdop = 0.0;
                posinfo_interval = POSINFO_INTERVAL;
            }
        }
        #endif
        
        gKeyNum = 0;
    }

    if(gKeyNum == 3)
    {
        INSTR_SECTION("key3");
        Serial.println("Right button pressed");

        gKeyNum = 0;
    }


    if (isPhoneReady == 1)
    {
        if (config_to_phone_prepare)
        {
            for(int config_cmds_index=0; config_cmds_index < json_configs_cnt; config_cmds_index++)
            {
                commandAction((char*)config_cmds[config_cmds_index], isPhoneReady, true);
            }

            sendMheard();

            config_to_phone_prepare_timer=millis();

            config_to_phone_prepare = false;
        }
        else
        {
            // wait after BLE Connect 3 sec.
            if((uint32_t)(millis() - config_to_phone_prepare_timer) < 3000)
                iPhoneState = 0;

            if (iPhoneState > 3)   // only every 6 times of mainloop send to phone  RAK 2 x ESP
            {
                // prepare JSON config to phone after BLE connection
                // send JSON config to phone after BLE connection
                if (ComToPhoneWrite != ComToPhoneRead)
                {
                    sendComToPhone();
                }
                else if (toPhoneWrite != toPhoneRead)
                {
                    sendToPhone();
                }
                else if (!conffin_sent)
                {
                    // both queues empty — send config finish once
                    commandAction((char*)"--conffin", isPhoneReady, true);
                    conffin_sent = true;
                }

                iPhoneState = 0;
            }
            else
            {
                iPhoneState++;
            }
        }

