icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
        // 5 minuten
        if((uint32_t)(millis() - config_to_phone_datetime_timer) >= (5 * 60 * 1000))
        {
            bNTPDateTimeValid=false;

            config_to_phone_datetime_timer = millis();
        }
    }

    // check NCNT modified
    int incnt = getMheardCount();
    if(ncnt_hold != incnt)
    {
        INSTR_SECTION("pos_timer");
        // minimal alle 60 sec
        if((uint32_t)(millis() - posinfo_timer_min) >= 60000)
        {
            posinfo_shot = true;
            ncnt_hold = incnt;
        }
    }

    // posinfo
    //Serial.print(getTimeString());
    //Serial.printf(" posinfo_timer:%ld posinfo_interval:%ld timer:%ld millis:%ld\n", posinfo_timer, posinfo_interval, (posinfo_timer + (posinfo_interval * 1000)), millis());

    // posinfo_interval in Seconds
    if (((uint32_t)(millis() - posinfo_timer) >= (uint32_t)(posinfo_interval * 1000)) || (millis() > 100000 && millis() < 130000 && bPosFirst) || posinfo_shot)
    {
        // minimal transmit time only max 30 sec
        if((uint32_t)(millis() - posinfo_timer_min) >= 30000)
        {
            if(bDisplayInfo)
            {
                Serial.print(getTimeString());
                Serial.printf(" [POS]...sendPostion initialized F:%i S:%i\n", bPosFirst, posinfo_shot);
            }

            bPosFirst = false;

            if(posinfo_shot)
            {
                double slat = 0.0;
                double slon = 0.0;

                double slatr=60.0;
                double slonr=60.0;

                slat = (int)posinfo_prev_lat;
                slatr = (posinfo_prev_lat - slat) * slatr;
                slat = (slat * 100.) + slatr;

                slon = (int)posinfo_prev_lon;
                slonr = (posinfo_prev_lon - slon) * slonr;
                slon = (slon * 100.) + slonr;
                double node_lat = cround4(posinfo_prev_lat);
                double node_lon = cround4(posinfo_prev_lon);

                char node_lat_c = 'N';
                char node_lon_c = 'E';

                if(posinfo_prev_lat < 0.0)
                    node_lat_c='S';
                else
                    node_lat_c='N';

                if(posinfo_prev_lon < 0.0)
                    node_lon_c='W';
                else
                    node_lon_c='E';

                { INSTR_SECTION("pos_tx"); sendPosition(posinfo_interval, node_lat, node_lat_c, node_lon, node_lon_c, meshcom_settings.node_alt, meshcom_settings.node_press, meshcom_settings.node_hum, meshcom_settings.node_temp, meshcom_settings.node_temp2, meshcom_settings.node_gas_res, meshcom_settings.node_co2, meshcom_settings.node_press_alt, meshcom_settings.node_press_asl); }
            }
            else
            {
                { INSTR_SECTION("pos_tx"); sendPosition(posinfo_interval, meshcom_settings.node_lat, meshcom_settings.node_lat_c, meshcom_settings.node_lon, meshcom_settings.node_lon_c, meshcom_settings.node_alt, meshcom_settings.node_press, meshcom_settings.node_hum, meshcom_settings.node_temp, meshcom_settings.node_temp2, meshcom_settings.node_gas_res, meshcom_settings.node_co2, meshcom_settings.node_press_alt, meshcom_settings.node_press_asl); }
            }

            posinfo_shot=false;

            posinfo_prev_lat = 0.0; // done
            posinfo_prev_lon = 0.0; // done

            posinfo_last_lat=posinfo_lat;
            posinfo_last_lon=posinfo_lon;

            posinfo_last_direction=posinfo_direction;
            posinfo_distance = 0.0;

            posinfo_timer = millis();

            if(pos_shot)
            {
                commandAction((char*)"--pos", isPhoneReady, false);
                pos_shot = false;
            }

            posinfo_timer_min = millis();
        }
    }
    else
    {
        posinfo_timer_min = millis();
    }

    // Trickle-HEY: adaptive interval (RFC 6206)
    if (((uint32_t)(millis() - heyinfo_timer) >= trickle_interval_ms) || bHeyFirst)
    {
        bHeyFirst = false;

        // Check for topology change
        int current_neighbors = getMheardCount();
        if(trickle_last_neighbor_count >= 0 && current_neighbors != trickle_last_neighbor_count)
        {
            trickle_interval_ms = TRICKLE_IMIN_S * 1000UL;
            trickle_consistent_count = 0;
        }
        trickle_last_neighbor_count = current_neighbors;

        // Trickle suppression
        if(trickle_consistent_count >= TRICKLE_K)
        {
            if(bDisplayInfo)
                Serial.printf("[MC-TRICKLE] SUPPRESS consistent=%d interval=%lums\n",
                    trickle_consistent_count, trickle_interval_ms);
        }
        else
        {
            { INSTR_SECTION("hey_tx"); sendHey(); }
        }

        trickle_interval_ms = min(trickle_interval_ms * 2, TRICKLE_IMAX_S * 1000UL);
        trickle_consistent_count = 0;

        heyinfo_timer = millis();
    }

    // TELEMETRY_INTERVAL in Minutes == 15 minutes default
    unsigned long akt_timer = meshcom_settings.node_parm_time;
    if(akt_timer < 5 || akt_timer > 120)
    {
        INSTR_SECTION("akt_timer");
        akt_timer = TELEMETRY_INTERVAL;
    }
    
    akt_timer = akt_timer * 1000 * 60; // in minutes

    if(iNextTelemetry < 5)
        akt_timer= 15 * 1000; // 15 Seconds PARM, UNIT, EQNS and 1st T-Message

    if (((uint32_t)(millis() - telemetry_timer) >= (uint32_t)akt_timer) || bHeyFirst)
    {
        bHeyFirst = false;
        
        { INSTR_SECTION("telemetry"); sendTelemetry(SOFTSER_APP_ID); }

        telemetry_timer = millis();
    }
    
    // ETH-01: link poll/heartbeat and the DHCP lease refresh must run
    // whenever Ethernet is up, not only for bGATEWAY -- a gateway-off /
    // webserver-on node (bWEBSERVER, see setup ~1086) has ETH hardware too
    // and was never renewing its lease nor logging link state. Both
    // functions already self-guard on neth.hasETHHardware (false when
    // neither bGATEWAY nor bWEBSERVER is set), so hoisting them here is a
    // no-op for nodes without ETH. Order: link edges/heartbeat first, then
    // the DHCP renew check, then (below) either the gateway UDP get/send or
    // the TM-45 NTP-only harvest -- exactly one of the latter two per pass.

