icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
    // TM-35 / N-20 instrumentation: link edges and the 60-s heartbeat
    ethLinkPoll();
    ethLinkHeartbeat();

    // DHCP refresh
    if(neth.hasETHHardware && (uint32_t)(millis() - dhcp_timer) >= (uint32_t)(DHCP_REFRESH * 60000))
    {
        // no need on static IPs
        if(!(strlen(meshcom_settings.node_ownip) > 6 && strlen(meshcom_settings.node_ownms) > 6 && strlen(meshcom_settings.node_owngw) > 6))
        {
            if(bDEBUG)
            {
                Serial.print(getTimeString());
                Serial.println(" [MAIN] checkDHCP");
            }

            { INSTR_SECTION("eth_dhcp"); neth.checkDHCP(); }
        }

        dhcp_timer = millis();
    }

    // get UDP & send UDP message from ringBufferOut if there is one to tx
    if(bGATEWAY)
    {
        INSTR_SECTION("gateway");
        int bUDPReceived = false;

        // check if we received a UDP packet
        if (neth.hasIPaddress)
        {
            bSPI_ETH_Active = true;   // SPI guard: Ethernet owns bus
            INSTR_SECTION("eth_udp");
            if(neth.getUDP() == 1)  // 1...no udp-paket received
            {
                { INSTR_SECTION("eth_udp_tx"); sendUDP(); }
            }
            else
            {
                bUDPReceived=true;

                if(bDEBUG)
                    Serial.println("LOOP GATEWAY actions UDP received");
            }
            bSPI_ETH_Active = false;  // SPI guard: release bus
            if(bPendingRadioRx) { bPendingRadioRx = false; startRadioReceive(); }
        }
        else
        {
            //neth.last_upd_timer = 0; // ETH new
        }

        // UDP Action for next loop
        if(!bUDPReceived)
        {
            meshcom_settings.node_hasIPaddress = neth.hasIPaddress;
            meshcom_settings.node_last_upd_timer = neth.last_upd_timer;
            
            // check HB response (we also check successful sending KEEP. check if they work together!)
            if((uint32_t)(millis() - neth.last_upd_timer) >= (uint32_t)(MAX_HB_RX_TIME * 1000))
            {
                if(bDEBUG)
                    Serial.println("LOOP GATEWAY last_upd_timer actions");

                neth.last_upd_timer = millis();

                // avoid TX and UDP
                if(!neth.hasIPaddress)
                {
                    neth.hasIPaddress = false;
                    iReceiveTimeOutTime = millis();

                    if(strlen(meshcom_settings.node_ownip) > 6 && strlen(meshcom_settings.node_ownms) > 6 && strlen(meshcom_settings.node_owngw) > 6)
                    {
                        if(bDEBUG)
                        {
                            Serial.print(getTimeString());
                            Serial.println(" [MAIN] initethETH fix-IP");
                        }

                        neth.initethfixIP();
                    }
                    else
                    {
                        Serial.print(getTimeString());
                        Serial.println(" [MAIN] resetDHCP (retry)");

                        // N-20: initethDHCP() wuerde den W5100S bei jedem
                        // Retry per initETH_HW() hardware-resetten — danach
                        // braucht die PHY-Aushandlung mehrere Sekunden und der
                        // Link-Check in startETH() sieht dauerhaft LinkOFF:
                        // ein einmal gezogenes Kabel verbindet nie wieder (auf
                        // Hardware beobachtet). Das volle HW-Init ist nur beim
                        // Boot noetig (Setup); hier reicht resetDHCP() ohne
                        // PHY-Reset — der Link-Zustand ist dann echt, und bei
                        // LinkOFF bricht startETH() sofort ab statt 10 s zu
                        // blocken.
                        neth.resetDHCP();
                    }
                }
            }
            // ETH-01: DHCP refresh moved above, ahead of this if(bGATEWAY)
            // block, so it also runs when bGATEWAY is off.
        }
    }
    else if(neth.hasIPaddress)
    {
        // TM-45: the block above never runs while bGATEWAY is off, so it
        // never reads the socket -- do only the NTP-reply harvest instead
        // of the full gateway receive path (no double read: exactly one of
        // the two branches runs per loop pass).
        INSTR_SECTION("udp"); neth.harvestNTP();
    }

    #if defined(SHTC3)

    // TEMP/HUM
    if (((uint32_t)(millis() - temphum_timer) >= TEMPHUM_INTERVAL))
    {
        if(shtc3_found)
        {
            INSTR_SECTION("shtc3");
            getTEMP();
        }

        temphum_timer = millis();
    }

    #endif

    #if defined(LPS33)

    if(bLPS33)
    {
        INSTR_SECTION("lps33");
        // DRUCK
        if (((uint32_t)(millis() - druck_timer) >= DRUCK_INTERVAL))
        {
            getPRESSURE();

            druck_timer = millis();

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }
        }
    }

    #endif

    { INSTR_SECTION("display_tick"); mainStartTimeLoop(); }

    if(DisplayOffWait > 0)
    {
        INSTR_SECTION("display_off");
        if ((int32_t)(millis() - DisplayOffWait) > 0)
        {
            DisplayOffWait = 0;
            if(bDisplayOff)
            {
                bDisplayIsOff=true;

                #if defined(BOARD_HELTEC_T114)
                digitalWrite(PIN_TFT_LEDA_CTL, HIGH);   // TFT OFF
                #endif

                sendDisplay1306(true, true, 0, 0, (char*)"#C");
            }
        }
    }
    
    // rebootAuto
    if(rebootAuto > 0)
    {
        INSTR_SECTION("reboot_auto");
        if ((int32_t)(millis() - rebootAuto) > 0)
        {
            rebootAuto = 0;

            #ifdef ESP32
                ESP.restart();
            #endif

            #if defined NRF52_SERIES
                // dfuAuto: --dfu will den UF2-Bootloader statt eines normalen
                // Neustarts. Beides laeuft ueber denselben verzoegerten Pfad, damit
                // die Quittung noch ueber BLE bzw. Seriell rausgeht, bevor der Reset
                // kommt -- ein Reset direkt in commandAction() verschluckt sie.
                //
                // N-19: enterUf2Dfu() (reset_mcu() in cores/nRF5/wiring.c) haengt
                // aus diesem Loop-Task -- auf Hardware reproduziert: --dfu liess das
                // Board mit stehender CPU zurueck (USB-Deskriptor blieb App-PID, kein
                // Reset). Derselbe reset_mcu()-Pfad funktioniert aus dem TinyUSB-Task
                // (1200-Baud-Touch), und NVIC_SystemReset() funktioniert aus genau
                // diesem Loop-Pfad (--reboot) -- verdaechtig ist sd_softdevice_disable()
                // im Loop-Kontext. Deshalb hier ohne SD-Disable: GPREGRET per
                // SoftDevice-SVC setzen (bei aktivem SoftDevice erlaubt, das BLE-Init
                // laeuft auf nRF52 immer) und den bewaehrten NVIC_SystemReset()
                // nehmen; der Bootloader liest GPREGRET beim Start und bleibt im
                // UF2-Modus (USB-Laufwerk).
                if(bEnterDfu)
                {
                    bEnterDfu = false;
                    sd_power_gpregret_clr(0, 0xFF);
                    sd_power_gpregret_set(0, 0x57);   // DFU_MAGIC_UF2_RESET (cores/nRF5/wiring.c)
                    uint32_t gpr = 0;
                    sd_power_gpregret_get(0, &gpr);
                    printfdeb("...GPREGRET=0x%02lX (0x57 -> UF2-Bootloader)\n", (unsigned long)gpr);
                    // Ack/Log noch ueber die CDC rausschreiben, bevor der Reset die
                    // USB-Verbindung kappt. Ohne flush+Wartezeit kam das Board in
                    // einem Hardware-Test trotz korrekt gesetztem GPREGRET als App
                    // statt als Bootloader zurueck.
                    Serial.flush();
                    delay(300);
                }

