icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
                NVIC_SystemReset();     // resets the device
            #endif
        }
    }

    { INSTR_SECTION("serial_cmd"); checkSerialCommand(); }

    if(BattTimeWait == 0)
        BattTimeWait = millis() - 31000;

    if ((uint32_t)(millis() - BattTimeWait) >= 30000)
    {
        if (tx_is_active == false && is_receiving == false)
        {
            global_batt = read_batt();
            global_proz = mv_to_percent(global_batt);

            BattTimeWait = millis();
        }
    }

    // Heap Monitor — always active, 60s interval
    if(!bDisplayLog)
    {
        static unsigned long heapMonTimer = 0;
        if (heapMonTimer == 0)
            heapMonTimer = millis();

        if ((uint32_t)(millis() - heapMonTimer) >= 60000)
        {
            uint32_t freeHeap = nrf52_getFreeHeap();

            if(nrf52_heapFree != freeHeap)
            {
                nrf52_heapFree = freeHeap;
                
                if (freeHeap < nrf52_heapMinFree) nrf52_heapMinFree = freeHeap;

                Serial.printf("%s;[HEAP];%lu;%lu;%lu;(mon)\n",
                    getTimeString().c_str(),
                    (unsigned long)freeHeap,
                    (unsigned long)nrf52_heapMinFree,
                    (unsigned long)nrf52_getMaxFreeBlock());
            }

            heapMonTimer = millis();
        }
    }

    #ifdef OneWire_GPIO
    if(bONEWIRE)
    {
        if(onewireTimeWait == 0)
            onewireTimeWait = millis() - 10000;


        if ((uint32_t)(millis() - onewireTimeWait) >= 30000)  // 30 sec
        {
            //if (tx_is_active == false && is_receiving == false)
            {
                if(one_found)
                    loop_onewire_ds18();

                if(dht_found)
                    loop_onewire_dht();

                onewireTimeWait = millis();

                if(wx_shot)
                {
                    commandAction((char*)"--wx", isPhoneReady, true);
                    wx_shot = false;
                }
            }
        }
    }
    #endif

    // read BMP Sensor
    #if defined(ENABLE_BMX280) || defined(ENABLE_AHT20)
    if(((bBMPON || bBMEON) && bmx_found) || (bAHT20ON && aht20_found))
    {
        unsigned long lreduction = 0;

        if ((uint32_t)(millis() - BMXTimeWait) >= 60000)   // 60 sec
        {
            #if defined(ENABLE_BMX280)
                if(loopBMX280())
                {
                    if(!aht20_found && !bmp3_found)
                    {
                        meshcom_settings.node_temp = getTemp();
                    }

                    if(!aht20_found)
                    {
                        meshcom_settings.node_hum = getHum();
                    }

                    if(!bmp3_found)
                    {
                        meshcom_settings.node_press = getPress();
                        meshcom_settings.node_press_alt = getPressALT();
                        meshcom_settings.node_press_asl = getPressASL(meshcom_settings.node_alt);
                    }

                    bmx_start = 0;
                }
                else
                {
                    if(bmx_start > 0)
                        lreduction = 58000;
                }
            #endif


            #if defined(ENABLE_AHT20)
                if(loopAHT20())
                {
                    meshcom_settings.node_temp = getAHT20Temp();
                    meshcom_settings.node_hum = getAHT20Hum();
                }
            #endif

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, false);
                wx_shot = false;
            }

            BMXTimeWait = millis() - lreduction; // wait for next messurement
        }
    }
    #endif

    // read BMP390 Sensor
    #if defined(ENABLE_BMP390)
    if((bBMP3ON && bmp3_found))
    {
        if ((uint32_t)(millis() - BMP3TimeWait) >= 60000)   // 60 sec
        {
            if(loopBMP390())
            {
                meshcom_settings.node_press = getPress3();
                if(!aht20_found)
                {
                    meshcom_settings.node_temp = getTemp3();
                }
                meshcom_settings.node_press_asl = getPressASL3();
                meshcom_settings.node_press_alt = getAltitude3();
            }

            BMP3TimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    #if defined(ENABLE_MC811)
    if(bMCU811ON && mcu811_found)
    {
        if(MCU811TimeWait == 0)
            MCU811TimeWait = millis() - 10000;

        if ((uint32_t)(millis() - MCU811TimeWait) >= 60000)   // 60 sec
        {
            // read MCU-811 Sensor
            if(loopMCU811())
            {
                meshcom_settings.node_co2 = geteCO2();
                
                if(wx_shot)
                {
                    commandAction((char*)"--wx", isPhoneReady, true);
                    wx_shot = false;
                }
            }

            MCU811TimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    #if defined(ENABLE_INA226)
    if(bINA226ON)
    {
        if(INA226TimeWait == 0)
            INA226TimeWait = millis() - 10000;

        if ((uint32_t)(millis() - INA226TimeWait) >= 60000)   // 60 sec
        {
            // read INA Sensor
            if(loopINA226())
            {
                meshcom_settings.node_vbus = getvBUS();
                meshcom_settings.node_vshunt = getvSHUNT();
                meshcom_settings.node_vcurrent = getvCURRENT();
                meshcom_settings.node_vpower = getvPOWER();
            }

            INA226TimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    // read every n seconds the bme680 sensor calculated from millis()
    #if defined(ENABLE_BMX680)
    if(bBME680ON && bme680_found)
    {
        if ((uint32_t)(millis() - bme680_timer) >= 60000 || delay_bme680 <= 0)
        {
            if (delay_bme680 <= 0)
            {
                getBME680();

