icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
            }

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }

            // calculate delay
            delay_bme680 = bme680_get_endTime() - millis();

            bme680_timer = millis();
        }
    }
    #endif

    // heartbeat
    if (bGATEWAY)
    {
        if ((uint32_t)(millis() - hb_timer) >= (uint32_t)(HEARTBEAT_INTERVAL * 1000))
        {
            if(bDisplayCont)
            {
                Serial.print(getTimeString());
                Serial.printf(" [UDP] sending Heartbeat\n");
            }

            { INSTR_SECTION("eth_heartbeat"); sendHeartbeat(); }

            hb_timer = millis();
        }
    }

    if(bEXTUDP)
    {
        bSPI_ETH_Active = true;   // SPI guard: Ethernet owns bus
        getExternUDP();
        flushExternQueue();
        bSPI_ETH_Active = false;  // SPI guard: release bus
        if(bPendingRadioRx) { bPendingRadioRx = false; startRadioReceive(); }
    }

    if(bWEBSERVER || bEXTUDP)
    {
        if (web_timer == 0 || ((uint32_t)(millis() - web_timer) >= (uint32_t)(HEARTBEAT_INTERVAL * 1000 * 30)))   // repeat 15 minutes
        {
            meshcom_settings.node_hasIPaddress = neth.hasIPaddress;

            web_timer = millis();

            #ifndef BOARD_RAK4630
                // restart WEB-Client
                stopWebserver();

                if(!meshcom_settings.node_hasIPaddress)
                    startWIFI();
            #endif

            // N-20-Falle: ohne initialisiertes Ethernet (Setup ueberspringt die
            // HW-Initialisierung, wenn weder Gateway noch Webserver aktiv sind,
            // oder es ist keine RAK13800 gesteckt) blockieren W5100S-Socket-Ops
            // (UdpExtern.begin()/sendExternHeartbeat()) den Loop-Task unbegrenzt
            // -- Node wirkt tot, Konsole ohne Echo, nur 1200-Baud-Touch hilft.
            // Reproduziert 2026-08-22: --extudp on bei Gateway/Webserver off
            // friert den Loop ab dem naechsten Durchlauf dauerhaft ein (auch
            // nach jedem Reboot, da gespeichert). Deshalb: Start nur mit IP.
            if(bWEBSERVER && neth.hasIPaddress)
            {
                bSPI_ETH_Active = true;
                startWebserver();
                bSPI_ETH_Active = false;
                if(bPendingRadioRx) { bPendingRadioRx = false; startRadioReceive(); }
            }

            if(bEXTUDP && neth.hasIPaddress)
            {
                bSPI_ETH_Active = true;
                startExternUDP();
                bSPI_ETH_Active = false;
                if(bPendingRadioRx) { bPendingRadioRx = false; startRadioReceive(); }
            }
        }

        if(bWEBSERVER)
        {
            bSPI_ETH_Active = true;   // SPI guard: Ethernet owns bus (web page delivery)
            loopWebserver();
            bSPI_ETH_Active = false;  // SPI guard: release bus
            if(bPendingRadioRx) { bPendingRadioRx = false; startRadioReceive(); }
        }

    }

    if (resendPing == 0)
        resendPing = millis();

    if(meshcom_settings.node_pingtime > 29)
    {
        if((int32_t)(millis() - (resendPing + meshcom_settings.node_pingtime * 1000)) > 0)
        {
            resendPing = millis();

            if(bDisplayInfo)
                printfdeb("[PING]...send Ping to %s\n", meshcom_settings.node_pingcall);

            if(meshcom_settings.node_pingcall[0] != 0x00)
                sendPing(meshcom_settings.node_pingcall);
        }
    }


    #if defined(HAS_TFT_114) or defined(BOARD_T_ECHO)
    }   // else from 
    #endif

    //  We are on FreeRTOS, give other tasks a chance to run
    delay(100);

    yield();
}

/** @brief Function to check if the modem detected a preamble
 */
void blinkLED()
{
    #if not defined(BOARD_HELTEC_T114)
    digitalWrite(LED_GREEN, HIGH);
    delay(20);
    digitalWrite(LED_GREEN, LOW);
    #endif
}

void blinkLED2()
{
    #if not defined(BOARD_HELTEC_T114)
    digitalWrite(LED_BLUE, HIGH);
    delay(20);
    digitalWrite(LED_BLUE, LOW);
    #endif
}


/**@brief Function for handling a LoRa tx timer timeout event.
 */
void getTEMP(void)
{
    sensors_event_t humidity, temp;

    shtc3.getEvent(&humidity, &temp); // populate temp and humidity objects with fresh data

    if(bWXDEBUG)
    {
        Serial.print("Temperature: "); Serial.print(temp.temperature); Serial.println(" degrees C");
        Serial.print("Humidity: "); Serial.print(humidity.relative_humidity); Serial.println("% rH");
    }

    meshcom_settings.node_temp2 = temp.temperature;
    meshcom_settings.node_hum = humidity.relative_humidity;
}

/**@brief Function for handling a LoRa tx timer timeout event.
 */
void getPRESSURE(void)
{
    sensors_event_t temp;
    sensors_event_t pressure;
    
    g_lps22hb.getEvent(&pressure, &temp);

    if(bWXDEBUG)
    {
        Serial.print("Temperature: ");Serial.print(temp.temperature);Serial.println(" degrees C");
        Serial.print("Pressure: ");Serial.print(pressure.pressure);Serial.println(" hPa");
        Serial.println("");
    }
    
    //double home_alt=meshcom_settings.node_alt;    // Höhe des Standorts
    //double temperature_gradient = 0.0065;           // Standard-Temperaturgradient
    //double temperatureK = temp.temperature + 273.15;     // Temperatur in Kelvin
    
    // barometrische Höhenformel
    //meshcom_settings.node_press = pressure.pressure * pow((temperatureK / (temperatureK + home_alt * temperature_gradient)) , -5.255);
    if(bLPS33)
    {
        meshcom_settings.node_press = pressure.pressure;
        meshcom_settings.node_temp = temp.temperature;
    }
    else
    {
        meshcom_settings.node_press = 0;
        meshcom_settings.node_temp = 0;
    }
}

/**@brief Function for analytical direction.
 */
void direction_parse(String tmp)
{
    if (tmp.indexOf(",E,") < 0 && tmp.indexOf(",W,") > 0)
    {
        direction_E_W = 0;  // WEST
    }
    else
    {
        direction_E_W = 1;  // EAST
    }
    
    if (tmp.indexOf(",N,") < 0 && tmp.indexOf(",S,") > 0)
    {
        direction_S_N = 1;  // SOUTH
    }
    else
    {
        direction_S_N = 0;  // NORTH
    }
}

/**@brief Function for handling a LoRa tx timer timeout event.
 */
#if defined(ENABLE_RAK_GPS)
// Hilfsfunktion zum Senden
void sendUBXCommand(String cmd)
{
  #if defined(USE_HELTEC_T114) or defined(BOARD_T_ECHO)
  Serial1.println(cmd);
  #else
  Serial1.println(cmd);
  #endif
  delay(100); // Kurze Pause für das Modul
}

uint32_t startTimeout;
String ver = "";

void WaitPause() {
  startTimeout = millis() + 1000;
  #if defined(USE_HELTEC_T114) or defined(BOARD_T_ECHO)
  while ((!Serial1.available()) && ((int32_t)(millis() - startTimeout) < 0)) { delay(5); } // auf Block von Zeichen warten
  #else
  while ((!Serial1.available()) && ((int32_t)(millis() - startTimeout) < 0)) { delay(5); } // auf Block von Zeichen warten
  #endif
  if(iGPSDEBUG >= 2)
    Serial.printf("[GPS ]...wait");
  startTimeout = millis() + 50;  // für Serial Sync Zeichenblock lesen und Pause von 50ms abwarten
  while ((int32_t)(millis() - startTimeout) < 0) {
    #if defined(USE_HELTEC_T114) or defined(BOARD_T_ECHO)
    if (Serial1.available()) {
      Serial1.read();
    #else
    if (Serial1.available()) {
      Serial1.read();
    #endif
      startTimeout = millis() + 50;  // retrigger timeout
    }
  }
}

const uint8_t UBX_MON_VER_RAK[] = {  // Size 8, swVersion, hwVersion
  0xB5, 0x62,             // Header (sync)
  0x0A, 0x04,             // Class, ID
  0x00, 0x00,             // Length (2 Bytes, Little Endian)
  0x0E, 0x34              // CK_A, CK_B
};

uint8_t ubx_cfg_gnss [] = {// GPS + GALILEO + GLONASS wo / SBAS
0xB5,0x62,0x06,0x3E, 0x3C, 0x00,
0x00,0x00,0x20,0x07,
0x00,0x00,0x10,0x00,0x01,0x00,0x01,0x01,
0x01,0x00,0x00,0x00,0x00,0x00,0x01,0x01,
0x02,0x00,0x08,0x00,0x01,0x00,0x01,0x01,
0x03,0x00,0x00,0x00,0x00,0x00,0x01,0x01,
0x04,0x00,0x00,0x00,0x00,0x00,0x01,0x01,
0x05,0x00,0x00,0x00,0x00,0x00,0x01,0x01,
0x06,0x00,0x10,0x00,0x01,0x00,0x01,0x01,
0xF5,0x8A};

void sendUBX_MON_VER() {  // Binäres Paket senden
  
  if(iGPSDEBUG >= 2)
    Serial.println("[GPS ]...Sende UBX_MON_VER");

