icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
  for (size_t i = 0; i < sizeof(UBX_MON_VER_RAK); i++)
  {
    Serial1.write(UBX_MON_VER_RAK[i]);
  }

  delay(100); // Kurze Pause für das Modul
}

void sendUBX_SET_GNSS() {  // Binäres Paket senden
  
  if(iGPSDEBUG >= 2)
    Serial.println("[GPS ]...Sende UBX_SET_GNSS");

  for (size_t i = 0; i < sizeof(ubx_cfg_gnss); i++)
  {
    Serial1.write(ubx_cfg_gnss[i]);
  }

  delay(100); // Kurze Pause für das Modul
}

String readUBXbin() {
  startTimeout = millis() + 500;
  ver = "";
    while ((int32_t)(millis() - startTimeout) < 0) {
    #if defined(USE_HELTEC_T114) or defined(BOARD_T_ECHO)
    while (Serial1.available()) {
      int c = Serial1.read();
    #else
    while (Serial1.available()) {
      int c = Serial1.read();
    #endif

      if ((ver.length() > 500) || (c == 0x0D)) { break; }  //TODO: mehr Zeichen für ganzen Versions-String
      if (c == 0xB5) { c = 0x75; }
      if ((c < 0x20) || (c > 0x7E)) { c = 0x2E; }
      ver = ver + char(c);
      startTimeout = millis() + 500;  // retrigger timeout
    }
  }
  return ver;
}

void SetupUBLOX()
{
  // 1. Alle Nachrichten (GSV) ausschalten, um Flut an Daten zu reduzieren
  sendUBXCommand("$PUBX,40,GSV,0,0,0,0,0,0*59");
  sendUBXCommand("$PUBX,40,VTG,0,0,0,0,0,0*5E");
  sendUBXCommand("$PUBX,40,GSA,0,0,0,0,0,0*4E");
  sendUBXCommand("$PUBX,40,GLL,0,0,0,0,0,0*5C");
  
  // 2. Nur GGA (Position) und RMC (Zeit/Datum/Speed) aktivieren
  sendUBXCommand("$PUBX,40,GGA,0,1,0,0,0,0*5B");
  sendUBXCommand("$PUBX,40,RMC,0,1,0,0,0,0*47");

  WaitPause(); // Pause zwischen Blöcken erreicht

  sendUBX_SET_GNSS();

  sendUBX_MON_VER();
  ver = readUBXbin();
  if(iGPSDEBUG >= 2)
    Serial.printf("[GPS_VER] %s\n", ver.c_str());

}

unsigned int getGPS(void)
{
    if(iGPSDEBUG > 1)
        Serial.println("-----------check GPS-----------");

    bool newData = false;
  
    // For one second we parse GPS data and report some key values
    for (unsigned long start = millis(); millis() - start < 1000;)
    {
      while (Serial1.available())
      {
        char c = Serial1.read();
        
        if(iGPSDEBUG > 2)
            Serial.write(c);

        if (tinyGPSPlus.encode(c))// Did a new valid sentence come in?
          newData = true;
      }
    }

    if(iGPSDEBUG > 1)
        Serial.printf("newData:%i SAT:%d Fix:%d UPD:%d VAL:%d HDOP:%i\n", newData, tinyGPSPlus.satellites.value(), tinyGPSPlus.sentencesWithFix(), tinyGPSPlus.location.isUpdated(), tinyGPSPlus.location.isValid(), tinyGPSPlus.hdop.value());

    posinfo_satcount = tinyGPSPlus.satellites.value();
    fposinfo_hdop = tinyGPSPlus.hdop.value();

    bool has_gnss_location=false;

    if ((tinyGPSPlus.hdop.value() < 300) && (tinyGPSPlus.satellites.value() > 4))
    {
        has_gnss_location = true;
        posinfo_fix = true;
    }
    else
    {
        posinfo_fix = false;
    }
    
    if (newData && has_gnss_location)
    {
        double dlat, dlon;
        
        dlat = tinyGPSPlus.location.lat();
        dlon = tinyGPSPlus.location.lng();

        meshcom_settings.node_lat = cround4(dlat);
        meshcom_settings.node_lon = cround4(dlon);

        if(tinyGPSPlus.location.rawLat().negative)
            meshcom_settings.node_lat_c = 'S';
        else
            meshcom_settings.node_lat_c = 'N';

        if(tinyGPSPlus.location.rawLng().negative)
            meshcom_settings.node_lon_c = 'W';
        else
            meshcom_settings.node_lon_c = 'E';

        meshcom_settings.node_alt = ((meshcom_settings.node_alt * 10) + (int)tinyGPSPlus.altitude.meters()) / 11;

        MyClock.setCurrentTime(meshcom_settings.node_utcoff, tinyGPSPlus.date.year(), tinyGPSPlus.date.month(), tinyGPSPlus.date.day(), tinyGPSPlus.time.hour(), tinyGPSPlus.time.minute(), tinyGPSPlus.time.second());
        snprintf(cTimeSource, sizeof(cTimeSource), (char*)"GPS");

        if(iGPSDEBUG > 1)
        {
            Serial.printf("INT: LAT:%lf%c LON:%lf%c ALT:%i (%i-%02i-%02i %02i:%02i:%02i)\n", meshcom_settings.node_lat, meshcom_settings.node_lat_c, meshcom_settings.node_lon, meshcom_settings.node_lon_c, meshcom_settings.node_alt,
            meshcom_settings.node_date_year, meshcom_settings.node_date_month,  meshcom_settings.node_date_day,
            meshcom_settings.node_date_hour, meshcom_settings.node_date_minute, meshcom_settings.node_date_second );
        }

        return setSMartBeaconing(dlat, dlon);
    }

    return POSINFO_INTERVAL;   // no GPS
}
#endif

void checkSerialCommand(void)
{
    // Serial available
    if(Serial)
    {
        // Check USB Serial input (Serial == MSerial after telnet_functions.h include)
        if(Serial.available() > 0)
        {
            char rd = (char)Serial.read();
            // Drop NUL bytes: UART RX noise (e.g. unpowered USB-UART bridge on battery
            // supply) delivers 0x00 which strlen() cannot see and wedges the parser
            // (DRY-22 — ported from the ESP32 copy of this function).
            if(rd != 0x00)
            {
                printdeb(rd);   // echo to USB + net console via MSerial
                strText[iTxtPos] = rd;
                if(iTxtPos < (int)sizeof(strText) - 1)
                {
                    iTxtPos++;
                }
            }
        }
    }

    iTxtLen = strlen(strText);

    // Self-healing: normally every stored byte is non-NUL, so strlen == iTxtPos.
    // A stray NUL in the buffer breaks that invariant and would block command
    // processing forever (early return below never reaches the memset). Discard.
    // (DRY-22 — ported from the ESP32 copy of this function.)
    if(iTxtLen != iTxtPos)
    {
        memset(strText, 0x00, sizeof(strText));
        iTxtPos = 0;
        return;
    }

    if(iTxtLen == 0)
        return;

    if(strText[0] == ':' || strText[0] == '-' || strText[0] == '{')
    {
        if(strText[iTxtLen-1] == '\n' || strText[iTxtLen-1] == '\r')
        {
            strTextWork = strText;
            strTextWork.trim();
            snprintf(strText, sizeof(strText), "%s", strTextWork.c_str());

