icssw-org/MeshCom-Firmware/src/nrf52/nrf52_main.cpp
            strncpy(msg_text, strText, sizeof(msg_text) - 1);
            msg_text[sizeof(msg_text) - 1] = '\0';

            int inext=0;
            // N-22: 600 B vom knappen 4-KB-Loop-Task-Stack in BSS verlagert —
            // checkSerialCommand() laeuft nur im Loop-Task, und der Pfad
            // ueber sendMessage() -> sendExtern() lief mit Watermark 0
            // (Details: STATUS-Box N-22 im Defektkatalog).
            static char msg_buffer[600];
            iTxtLen = strlen(strText);
            for(int itx=0; itx<iTxtLen; itx++)
            {
                if(msg_text[itx] == 0x08 || msg_text[itx] == 0x7F)
                {
                    inext--;
                    if(inext < 0)
                        inext=0;
                        
                    msg_buffer[inext+1]=0x00;
                }
                else
                {
                    msg_buffer[inext]=msg_text[itx];
                    msg_buffer[inext+1]=0x00;
                    inext++;

                    // buffer size reached
                    if(inext > (int)sizeof(msg_buffer)-2)
                        break;
                }
            }

            if(strText[0] == ':' && strText[1] == ':')
            {
                // BP-01: origin serial -- the notice comes back on the console.
                setMsgOrigin(ORIGIN_SERIAL);
                (void)sendMessage(msg_buffer, inext);
                setMsgOrigin(ORIGIN_NONE);
            }
            else
                if(strText[0] == '-' && strText[1] == '-')
                    commandAction(msg_buffer, isPhoneReady, false);
                else
                    printfdeb("\n...wrong command %s\n", strText);

            memset(strText, 0x00, sizeof(strText));
            iTxtPos = 0;
        }
    }
    else
    {
        if(bDEBUG)
        {
            if(strText[0] != '\n' && strText[0] != '\r')
            {
                printfdeb("MSG:%02X..not sent\n", (unsigned char)strText[0]);
            }
        }

        memset(strText, 0x00, sizeof(strText));
        iTxtPos = 0;
    }
}

/**@brief UDP tx Routine
 */
void sendUDP()
{
    if(udpWrite != udpRead)
    {
        if(bDisplayCont)
            Serial.printf("udpWrite:%i udpRead:%i neth.udp_is_busy:%i\n", udpWrite, udpRead, neth.udp_is_busy);

        if(!neth.udp_is_busy)
        {
            // CONC-16 (nRF52-Leser): der Schreiber addUdpOutBuffer() laeuft
            // ueber addNodeData() im Timer-Service-Task (OnRxDone, siehe
            // C-01) und kann diesen Slot per Ring-voll-Eviction ueberholen,
            // waehrend hier gesendet wird. Laenge und Payload deshalb als
            // Snapshot unter kurzem Lock lesen und den Index-Advance unten
            // gegen ein zwischenzeitliches Vorruecken sichern — gleiche
            // Behandlung wie sendMeshComUDP() in udp_functions.cpp (ESP32).
            // Snapshot bewusst groesser als der Quell-Slot und nullgefuellt
            // (siehe dortige Begruendung).
            static uint8_t udpSnapshot[UDP_TX_BUF_SIZE+64] = {0};
            int mySlot = udpRead;
            /*BISECT*/ memcpy(udpSnapshot, ringBufferUDPout[mySlot], sizeof(ringBufferUDPout[0]));

            uint16_t msg_len = udpSnapshot[0];

            // send it over UDP
            if (!neth.sendUDP(udpSnapshot + 1, msg_len))
            {
                Serial.printf("Sending UDP Packet failed <%i>!\n", msg_len);

                DEBUG_MSG("ERROR", "Sending UDP Packet failed!");

                err_cnt_udp_tx++;
                // if we have too much errors sending, reset UDP
                if (err_cnt_udp_tx >= MAX_ERR_UDP_TX)
                {
                    // avoid TX and UDP
                    neth.hasIPaddress = false;

                    Serial.print(getTimeString());
                    Serial.printf(" [MAIN] resetDHCP\n");

                    err_cnt_udp_tx = 0;
                    neth.resetDHCP();
                }
            }
            else
            {
                // UDP DATA Header 36 byte. Der Slot enthaelt msg_len Bytes ab
                // Offset 1 (Header + APRS-Frame); msg_len Bytes ab Offset 1+36
                // zu kopieren las 36 Bytes ueber das Geschriebene hinaus — bei
                // msg_len > 239 sogar ueber das Slot-Ende (Slot ist
                // UDP_TX_BUF_SIZE+20). Wahre APRS-Laenge ist msg_len-36.
                // (Nebenbefund aus dem CONC-16-Commit; auf nRF52-Gateways
                // aktiv — Schreiber ist addUdpOutBuffer() via addNodeData(),
                // auf Hardware am TX-UDP-Log verifiziert.)
                uint16_t aprs_len = (msg_len > 36) ? (uint16_t)(msg_len - 36) : 0;
                memcpy(convBuffer, udpSnapshot + 1 + 36, aprs_len);

                if(aprs_len > 0 && (convBuffer[0] == 0x3A || convBuffer[0] == 0x21 || convBuffer[0] == 0x40))
                {
                    struct aprsMessage aprsmsg;

                    // print which message type we got
                    decodeAPRS(convBuffer, aprs_len, aprsmsg);

                    // print aprs message
                    if(bDisplayVia)
                    {
                        printBuffer_aprs((char*)"[MESHu]...TX-UDP  ", aprsmsg);
                    }
                    else
                    {
                        if(bDisplayInfo)
                        {
                            printBuffer_aprs((char*)"TX-UDP  ", aprsmsg);
                        }
                    }
                }
            }

            // zero out sent buffer and advance the read pointer under the same
            // lock as the writer's addRingPointer() (CONC-16). Guard against a
            // writer having already force-advanced udpRead past us via the
            // ring-full eviction path while we were sending.
            /*BISECT*/ if (udpRead == mySlot)
            {
                memset(ringBufferUDPout[mySlot], 0, UDP_TX_BUF_SIZE);
                udpRead++;
                if (udpRead >= MAX_RING_UDP)
                    udpRead = 0;
            }

        }
        else
        {
            DEBUG_MSG("UDP", "UDP busy. Sending asap");
        }
    }
}

/**@brief Function to send our heartbeat
 * longanme0x000xAABBCCDDKEEPGW0110x00
 *               GW_ID
 */
void sendHeartbeat()
{
    if (!neth.hasIPaddress)
        return;

    sendKEEP();

}